app/controllers/pubs_controller.rb

SELECT * FROM `pubs`
---
  def index
    @pubs = Pub.all